ixty/apw/portable/packages/deauther/hardware/esp8266/2.0.0-deauther/boards.txt
##############################################################
# ESP8285 chip has built-in 1MB flash

esp8285.name=Generic ESP8285 Module

esp8285.upload.tool=esptool
esp8285.upload.speed=115200
esp8285.upload.resetmethod=ck
esp8285.upload.maximum_size=434160
esp8285.upload.maximum_data_size=81920
esp8285.upload.wait_for_upload_port=true
esp8285.serial.disableDTR=true
esp8285.serial.disableRTS=true

esp8285.build.mcu=esp8266
esp8285.build.f_cpu=80000000L
esp8285.build.board=ESP8266_ESP01
esp8285.build.core=esp8266
esp8285.build.variant=generic
esp8285.build.flash_mode=dout
esp8285.build.flash_freq=40
esp8285.build.spiffs_pagesize=256
esp8285.build.debug_port=
esp8285.build.debug_level=

esp8285.menu.CpuFrequency.80=80 MHz
esp8285.menu.CpuFrequency.80.build.f_cpu=80000000L
esp8285.menu.CpuFrequency.160=160 MHz
esp8285.menu.CpuFrequency.160.build.f_cpu=160000000L

esp8285.menu.FlashMode.dout=DOUT
esp8285.menu.FlashMode.dout.build.flash_mode=dout
esp8285.menu.FlashMode.qout=QOUT
esp8285.menu.FlashMode.qout.build.flash_mode=qout
esp8285.menu.FlashMode.dio=DIO
esp8285.menu.FlashMode.dio.build.flash_mode=dio
esp8285.menu.FlashMode.qio=QIO
esp8285.menu.FlashMode.qio.build.flash_mode=qio

esp8285.menu.UploadSpeed.115200=115200
esp8285.menu.UploadSpeed.115200.upload.speed=115200
esp8285.menu.UploadSpeed.9600=9600
esp8285.menu.UploadSpeed.9600.upload.speed=9600
esp8285.menu.UploadSpeed.57600=57600
esp8285.menu.UploadSpeed.57600.upload.speed=57600
esp8285.menu.UploadSpeed.256000.windows=256000
esp8285.menu.UploadSpeed.256000.upload.speed=256000
esp8285.menu.UploadSpeed.230400.linux=230400
esp8285.menu.UploadSpeed.230400.macosx=230400
esp8285.menu.UploadSpeed.230400.upload.speed=230400
esp8285.menu.UploadSpeed.460800.linux=460800
esp8285.menu.UploadSpeed.460800.macosx=460800
esp8285.menu.UploadSpeed.460800.upload.speed=460800
esp8285.menu.UploadSpeed.512000.windows=512000
esp8285.menu.UploadSpeed.512000.upload.speed=512000
esp8285.menu.UploadSpeed.921600=921600
esp8285.menu.UploadSpeed.921600.upload.speed=921600

esp8285.menu.FlashSize.1M512=1M (512K SPIFFS)
esp8285.menu.FlashSize.1M512.build.flash_size=1M
esp8285.menu.FlashSize.1M512.build.flash_ld=eagle.flash.1m512.ld
esp8285.menu.FlashSize.1M512.build.spiffs_start=0x7B000
esp8285.menu.FlashSize.1M512.build.spiffs_end=0xFB000
esp8285.menu.FlashSize.1M512.build.spiffs_blocksize=8192
esp8285.menu.FlashSize.1M512.upload.maximum_size=499696

esp8285.menu.FlashSize.1M256=1M (256K SPIFFS)
esp8285.menu.FlashSize.1M256.build.flash_size=1M
esp8285.menu.FlashSize.1M256.build.flash_ld=eagle.flash.1m256.ld
esp8285.menu.FlashSize.1M256.build.spiffs_start=0xBB000
esp8285.menu.FlashSize.1M256.build.spiffs_end=0xFB000
esp8285.menu.FlashSize.1M256.build.spiffs_blocksize=4096
esp8285.menu.FlashSize.1M256.upload.maximum_size=761840

esp8285.menu.FlashSize.1M192=1M (192K SPIFFS)
esp8285.menu.FlashSize.1M192.build.flash_size=1M
esp8285.menu.FlashSize.1M192.build.flash_ld=eagle.flash.1m192.ld
esp8285.menu.FlashSize.1M192.build.spiffs_start=0xCB000
esp8285.menu.FlashSize.1M192.build.spiffs_end=0xFB000
esp8285.menu.FlashSize.1M192.build.spiffs_blocksize=4096
esp8285.menu.FlashSize.1M192.upload.maximum_size=827376

esp8285.menu.FlashSize.1M160=1M (160K SPIFFS)
esp8285.menu.FlashSize.1M160.build.flash_size=1M
esp8285.menu.FlashSize.1M160.build.flash_ld=eagle.flash.1m160.ld
esp8285.menu.FlashSize.1M160.build.spiffs_start=0xD3000
esp8285.menu.FlashSize.1M160.build.spiffs_end=0xFB000
esp8285.menu.FlashSize.1M160.build.spiffs_blocksize=4096
esp8285.menu.FlashSize.1M160.upload.maximum_size=860144

esp8285.menu.FlashSize.1M144=1M (144K SPIFFS)
esp8285.menu.FlashSize.1M144.build.flash_size=1M
esp8285.menu.FlashSize.1M144.build.flash_ld=eagle.flash.1m144.ld
esp8285.menu.FlashSize.1M144.build.spiffs_start=0xD7000
esp8285.menu.FlashSize.1M144.build.spiffs_end=0xFB000
esp8285.menu.FlashSize.1M144.build.spiffs_blocksize=4096
esp8285.menu.FlashSize.1M144.upload.maximum_size=876528

esp8285.menu.FlashSize.1M128=1M (128K SPIFFS)
esp8285.menu.FlashSize.1M128.build.flash_size=1M
esp8285.menu.FlashSize.1M128.build.flash_ld=eagle.flash.1m128.ld
esp8285.menu.FlashSize.1M128.build.spiffs_start=0xDB000
esp8285.menu.FlashSize.1M128.build.spiffs_end=0xFB000
esp8285.menu.FlashSize.1M128.build.spiffs_blocksize=4096
esp8285.menu.FlashSize.1M128.upload.maximum_size=892912

esp8285.menu.FlashSize.1M64=1M (64K SPIFFS)
esp8285.menu.FlashSize.1M64.build.flash_size=1M
esp8285.menu.FlashSize.1M64.build.flash_ld=eagle.flash.1m64.ld
esp8285.menu.FlashSize.1M64.build.spiffs_start=0xEB000
esp8285.menu.FlashSize.1M64.build.spiffs_end=0xFB000
esp8285.menu.FlashSize.1M64.build.spiffs_blocksize=4096
esp8285.menu.FlashSize.1M64.upload.maximum_size=958448


##############################################################
WIFI_Kit_8.name=WIFI_Kit_8

WIFI_Kit_8.upload.tool=esptool
WIFI_Kit_8.upload.speed=460800
WIFI_Kit_8.upload.resetmethod=nodemcu
WIFI_Kit_8.upload.maximum_size=1044464
WIFI_Kit_8.upload.maximum_data_size=81920
WIFI_Kit_8.upload.wait_for_upload_port=true
WIFI_Kit_8.serial.disableDTR=true
WIFI_Kit_8.serial.disableRTS=true

WIFI_Kit_8.build.mcu=esp8266
WIFI_Kit_8.build.f_cpu=80000000L
WIFI_Kit_8.build.board=ESP8266_WEMOS_D1MINI
WIFI_Kit_8.build.core=esp8266
WIFI_Kit_8.build.variant=WIFI_Kit_8
WIFI_Kit_8.build.flash_mode=dio
WIFI_Kit_8.build.flash_size=4M
WIFI_Kit_8.build.flash_freq=40
WIFI_Kit_8.build.debug_port=
WIFI_Kit_8.build.debug_level=

WIFI_Kit_8.menu.CpuFrequency.80=80 MHz
WIFI_Kit_8.menu.CpuFrequency.80.build.f_cpu=80000000L
WIFI_Kit_8.menu.CpuFrequency.160=160 MHz
WIFI_Kit_8.menu.CpuFrequency.160.build.f_cpu=160000000L

WIFI_Kit_8.menu.UploadSpeed.921600=921600
WIFI_Kit_8.menu.UploadSpeed.921600.upload.speed=921600
WIFI_Kit_8.menu.UploadSpeed.115200=115200
WIFI_Kit_8.menu.UploadSpeed.115200.upload.speed=115200
WIFI_Kit_8.menu.UploadSpeed.9600=9600
WIFI_Kit_8.menu.UploadSpeed.9600.upload.speed=9600
WIFI_Kit_8.menu.UploadSpeed.57600=57600
WIFI_Kit_8.menu.UploadSpeed.57600.upload.speed=57600
WIFI_Kit_8.menu.UploadSpeed.256000.windows=256000
WIFI_Kit_8.menu.UploadSpeed.256000.upload.speed=256000
WIFI_Kit_8.menu.UploadSpeed.230400.linux=230400
WIFI_Kit_8.menu.UploadSpeed.230400.macosx=230400
WIFI_Kit_8.menu.UploadSpeed.230400.macosx=230400
WIFI_Kit_8.menu.UploadSpeed.230400.upload.speed=230400
WIFI_Kit_8.menu.UploadSpeed.460800.linux=460800
WIFI_Kit_8.menu.UploadSpeed.460800.macosx=460800
WIFI_Kit_8.menu.UploadSpeed.460800.upload.speed=460800
WIFI_Kit_8.menu.UploadSpeed.512000.windows=512000
WIFI_Kit_8.menu.UploadSpeed.512000.upload.speed=512000


WIFI_Kit_8.menu.FlashSize.4M3M=4M (3M SPIFFS)
WIFI_Kit_8.menu.FlashSize.4M3M.build.flash_size=4M
WIFI_Kit_8.menu.FlashSize.4M3M.build.flash_ld=eagle.flash.4m.ld
WIFI_Kit_8.menu.FlashSize.4M3M.build.spiffs_start=0x100000
WIFI_Kit_8.menu.FlashSize.4M3M.build.spiffs_end=0x3FB000
WIFI_Kit_8.menu.FlashSize.4M3M.build.spiffs_blocksize=8192
WIFI_Kit_8.menu.FlashSize.4M3M.build.spiffs_pagesize=256

WIFI_Kit_8.menu.FlashSize.4M1M=4M (1M SPIFFS)
WIFI_Kit_8.menu.FlashSize.4M1M.build.flash_size=4M
WIFI_Kit_8.menu.FlashSize.4M1M.build.flash_ld=eagle.flash.4m1m.ld
WIFI_Kit_8.menu.FlashSize.4M1M.build.spiffs_start=0x300000
WIFI_Kit_8.menu.FlashSize.4M1M.build.spiffs_end=0x3FB000
WIFI_Kit_8.menu.FlashSize.4M1M.build.spiffs_blocksize=8192
WIFI_Kit_8.menu.FlashSize.4M1M.build.spiffs_pagesize=256

